{
    "ACTIVITY": "Activity",
    "ASSESSMENT": "Assessment",
    "INSTRUCTIONS": "Instructions",
    "LANGUAGE": "<img src=\"images/spain.png\">Spanish",
    "CREATED-BY": "Website created by <a class='fa fa-copyright'></a> <a href='http://domofera.com/'>Domofera Team</a>",
    "AB-HEADER": "GCB-creator is an interactive user interface that creates <b><i>Activities</i></b> and <b><i>Assesments</i></b> for the MOOC's creator Google Course Builder.</p><p>It's been developed by <b>Domofera team</b>:",
    "AB-TEAM": "Team",
    "AB-ALEX-1": "Front-end developer",
    "AB-ALEX-2": "Web developer and designer. UI & UX designer. Latest technologies and good development patterns lover. You can see his projects on his website <a href=\"http://codigoalternativo.com/\">Codigo Alternativo</a>.",
    "AB-ELENA-1": "Back-end developer",
    "AB-ELENA-2": "Web developer and designer. Specialized in user-centered design, interaction design and agile development methodologies.",
    "AB-LAURA-1": "Project & e-marketing manager",
    "AB-LAURA-2": "Entrepreneurial, courageous and enthusiastic. Convinced that teamwork is the key to success.",
    "AB-CANI-1": "Designer & Post-productor",
    "AB-CANI-2": "A utility guy, creative, excited about innovation and technology. He likes big challenges. Happy with what he does.",
    "ALERT-INSERT-1": "Insert questions by using the buttons ",
    "ALERT-INSERT-2": " from the toolbar.",
    "TOOLBAR-CLEANALL": "Clean all",
    "TOOLBAR-DOWNLOAD": "Download",
    "TOOLBAR-OPEN-FILE": "Open file",
    "TOOLBAR-COLLAPSE": "Collapse / Expand",
    "NEW-NUMERIC": "New numeric",
    "NEW-FREETEXT": "New Free-Text",
    "NEW-MULTICHOICE": "New Multiple Choice",
    "TITLE": "Title...",
    "ASS-TITLE-INCORRECT": "Incorrect format. It should be \"assessment-...\"",
    "PREAMBLE": "Preamble",
    "AUTO-CHECK": "Auto-check",
    "FREETEXT": "Free-text",
    "NUMERIC": "Numeric",
    "MULTICHOICE": "Multiple Choice",
    "QUESTION-C": "Question",
    "ANSWER-C": "Answer",
    "UNIT-DOT-LESSON": "Unit.Lesson",
    "UNIT-DOT-LESSON-BELONGS": "(Unit.Lesson) to which the question belongs",
    "NUMBER": "Number",
    "ALERT-BETA": "This is the beta versión 1.0. If you get any error, feel free to send an email <a href=\"mailto:domoferaapp@gmail.com?Subject=Error user\" target=\"_top\">domoferaapp@gmail.com</a> telling about that error being as specific as posible. Thanks for your cooperation",
    "NO-MORE-ANSWERS": "You can't insert more than {{length}} answers",
    "INS-GENERALS": "Generals",
    "INS-WELL-1": "If Google Course Builder doesn't check the Free-text questions, make the next changes:",
    "INS-WELL-2": "Within <i>assets/lib/activity-generic-1.3.js</i> (or your generic checker):",
    "INS-WELL-3": "<b>Line 414:</b> Replace with <b>\"<i>var correctAnswerRegex = params.correctAnswerString;</i>\"</b>",
    "INS-WELL-4": "<b>Line 466:</b> Replace with <b>\"<i>var isCorrect = (correctAnswerRegex == textValue);</i>\"</b>",
    "INS-FILES": "Files",
    "INS-FILES-1": "<b>GCB creator</b> carries out some algorithms in order to check the uploaded files. When these files are created by the application, there is no trouble. Otherwise, if there is an syntax or filename error the application should report it. Anyway, for security reasons, follow this advices: ",
    "INS-FILES-2": "Don't name the files using symbols or accents (it's allowed - or _).",
    "INS-FILES-3": "Look over the files if they have been hand-written. Maybe an error that hasn't been detected so far could appear.",
    "INS-TOOLBAR": "Toolbar",
    "INS-TOOLBAR-1": "The toolbar is located at the top of the Activity and Assessment pages.",
    "INS-TOOLBAR-2": "There are two button groups:",
    "INS-TOOLBAR-3": "<b>Generals:</b> In this order, the buttons functionalities are Clean questions, Download file, Upload file, Colapse questions.",
    "INS-TOOLBAR-4": "<b>Creators:</b> They are used to create any question. They are also located in the space between the questions.",
    "INS-ORDER": "Sort",
    "INS-ORDER-1": "The questions can be sorted by drag and drop it in the gapes. To do that, click on the left part of the question frame.",
    "INS-ORDER-3": "In order to improve the application usability, it's allowed to insert a question in the correct position, by clicking the icon  <i class=\"fa fa-plus\"></i> located between the question blocks.",
    "INS-EDIT": "Edit",
    "INS-EDIT-1": "For the fields that require a lot of text, you can open a bigger editor by clicking in the right button that is provided for these fields. You also can increase the field height.</p><p>There are some of these fields that can contaien <b>rich text format</b>. If you open the complete editor for one of these fields, you'll see a format edition toolbar",
    "INS-EDIT-2": "For the <b>plain text fields</b>, there will be no format edition toolbar.",
    "INS-AUTOSAVE": "Auto-save",
    "INS-AUTOSAVE-1": "The application will save your progress at any change you make, so you don't need to worry about it. In addition, when you activity or assessment page is loaded, it will check if there is any opened session, in case you want to load it.",
    "INS-TITLE": "Title",
    "INS-TITLE-1": "You must write a correct title, otherwise you won't be able to download the file. For that, follow the placeholder format. A message will be shown if there is an error.</p><p>This is the difference between an incorrect and a correct title.",
    "INS-ACTIVITY": "Activity",
    "INS-ACTIVITY-1": "On an activity, you can choose between 3 question types. Also you can insert custom HTML between questions. Every question type has its own <b>\"Question formulation\"</b> field, so it won't be mentioned later.",
    "INS-ACTIVITY-2": "This is not a question, so it won't be checked as it. It's only custom HTML that you can insert between questions.",
    "INS-ACTIVITY-22": "Free text",
    "INS-ACTIVITY-222": "It's composed by:",
    "INS-ACTIVITY-3": "<b>Answer:</b> It's case insensitive text.",
    "INS-ACTIVITY-4": "<b>Feedback correct:</b> It's shown when the question is correct.",
    "INS-ACTIVITY-5": "<b>Feedback incorrect:</b> It's shown when the question is incorrect.",
    "INS-ACTIVITY-6": "Multiple choice",
    "INS-ACTIVITY-7": "Question that can contain a maximum of 6 answers. More than one correct is allowed.",
    "INS-ACTIVITY-FIELDS": "It's composed by:",
    "INS-ACTIVITY-8": "<b>Answer:</b> it's the answer, text-based.",
    "INS-ACTIVITY-9": "<b>Feedback:</b> for that answer.",
    "INS-ACTIVITY-10": "It will be shown buttons for select, remove and add answers.",
    "INS-ACTIVITY-11": "Group multiple",
    "INS-ACTIVITY-12": "This is a group of the questions mentioned just before, with some variations. Now the feedback is general for all the questions, and it must be written how many minimum questions must be answered right.",
    "INS-ACTIVITY-13": "<b>Feedback correct:</b> it's displayed when the student surpasses the minimum correct answer number.",
    "INS-ACTIVITY-14": "<b>Feedback incorrect:</b> it's displayed when the student doesn't surpass the minimum correct answer number.",
    "INS-ACTIVITY-15": "<b>Questions list:</b> each question has its own fields. Also has <i>multi-selectable</i> field, that allow the student select more than one correct choice.",
    "INS-ASSESSMENT": "Assessment",
    "INS-ASSESSMENT-1": "An assessment is very similar to an activity. There are three question types, and they also are similar.",
    "INS-ASSESSMENT-11": "The assessment fields are:",
    "INS-ASSESSMENT-2": "<b>Preamble:</b> this is the text preceding the assessment.",
    "INS-ASSESSMENT-3": "<b>Auto-check:</b> if it is checked, it will allow the student to check the answers.",
    "INS-ASSESSMENT-4": "<b>Questions list:</b> they have the <i>question field</i>, and another where it has to be written the <i>unit-lesson</i> to which the question belongs. The format must be \"number.number\", such as <i>9.3</i>. Also a question has an answer field.",
    "INS-ASSESSMENT-5": "Numeric",
    "INS-ASSESSMENT-55": "Numeric answer. It can be a decimal number, separated by a dot.",
    "INS-ASSESSMENT-6": "Free text",
    "INS-ASSESSMENT-66": "Text-based answer, case insensitive.",
    "INS-ASSESSMENT-7": "Multiple choice",
    "INS-ASSESSMENT-77": "Contains some selectable choices.",
    "NEW-HTML": "New HTML",
    "NEW-GMULTICHOICE": "New Multiple Choice Group",
    "TITLE-INCORRECT": "Incorrect format. You must write \"activity-X.X\" where X means \"unit.activity\"",
    "ONLY-HTML": "Only HTML",
    "FEEDBACK-OK": "Feedback correct",
    "FEEDBACK-WRONG": "Feedback incorrect",
    "ANSWERS-C": "Answers",
    "FEEDBACK": "Feedback",
    "CORRECT": "Correct",
    "FORMULATION": "Formulation",
    "MIN-QUESTIONS": "Minimum correct questions required",
    "QUESTIONS-C": "Questions",
    "MULTISELECT": "Multi-selectable",
    "TEXT": "Text",
    "ADD": "Add",
    "JS-SESSION-OPENED": "There is an opened session, Do you want to load it?",
    "JS-CLEAN-ALL": "It will erase everything, ¿Are you sure?",
    "JS-IS-NOT-JAVASCRIPT": "This is not a javascript file, or the filename is incorrect. Please, avoid using unusual symbols or accents",
    "JS-SERVER-ERROR": "An error ocurred on the server. Please, report this by email to <a href=\"mailto:domoferaapp@gmail.com?Subject=Error server\" target=\"_top\">domoferaapp@gmail.com</a>",
    "JS-IS-NOT-ASSESSMENT": "",
    "JS-UPLOAD-ERROR": "An error ocurred while the file uploading. Please, try again.",
    "JS-SYNTAX-ERROR": "There is some syntax error Hay algún error de sintaxis en el fichero que has subido. Por favor, revisalo y vuelve a subirlo",
    "JS-NOT-JAVASCRIPT": "It's now allowed to insert No se puede insertar código javascript en una actividad, esos datos se han omitido",
    "JS-NOT-REGEX": "No se admite el campo correctAnswerRegex. Se ha cambiado por un correctAnswerString vacío",
    "JS-IS-NOT-ACTIVITY": "This file is not an activity!!"
}